#include "common.h"

typedef struct yetAnotherUnkStruct {
/* 0x00 */ s32 unk_00;
/* 0x04 */ s16 unk_04;
/* 0x06 */ s16 unk_06;
/* 0x08 */ s32 unk_08;
/* 0x0C */ Vec4f unk_0C;
/* 0x1C */ s32 unk_1C;
/* 0x20 */ s32 unk_20;
/* 0x24 */ s32 unk_24;
/* 0x28 */ void* (*unk_28)();
} yetAnotherUnkStruct;

extern yetAnotherUnkStruct D_800F8A50_MushroomShop[];

extern s32 D_800F8A30_MushroomShop[];
void func_800F67B0_MushroomShop(void);
void func_800F688C_MushroomShop(void);
void func_800F6C58_MushroomShop(void);
void func_800F73C8_MushroomShop(void);
void func_800F6B68_MushroomShop(omObjData*);
void func_800F6778_MushroomShop(s32);
extern omObjData* D_800F8DE8_MushroomShop;
void func_800F6C00_MushroomShop(omObjData*);
extern s16 D_800F384C;
extern char D_800F8D10_MushroomShop[];
extern char D_800F8D18_MushroomShop[];
extern s16 D_800F8D70_MushroomShop;
extern Process* D_800F8D74_MushroomShop;
extern unkCommonStruct0 D_800F8D78_MushroomShop[];
extern s16 D_800F8D8C_MushroomShop[];
extern s16 D_800F8DE0_MushroomShop;
extern s16 D_800F8DE2_MushroomShop;
extern u16 D_800F8DE4_MushroomShop;
extern Vec3f* D_800ED610;
extern Vec3f* D_800ED72C;
extern Vec3f D_800F89A0_MushroomShop[];
extern Vec3f D_800F89C4_MushroomShop[];
extern s16 D_800F3B74;
void func_800F6BC4_MushroomShop(void);

