#include "common.h"

typedef struct unk_FaceLift_00 {
/* 0x00 */ f32 unk_00;
/* 0x04 */ char unk_04[0x24];
/* 0x28 */ f32 unk_28;
/* 0x2C */ char unk_2C[0x24];
/* 0x50 */ f32 unk_50;
} unk_FaceLift_00;

typedef struct unk_FaceLift_01 {
/* 0x00 */ f32 unk_00;
/* 0x04 */ f32 unk_04;
/* 0x08 */ char unk_08[0x20];
} unk_FaceLift_01;

void func_800F9B38_12F178(void);
s16 func_8002451C(s32, void*, s32);
void func_80025830(s16, f32, f32, f32);
void func_800258EC(s16, s32, s32);
void func_80025F10(s16, s32);
void func_800F80A4_12D6E4(omObjData*, s32);
void func_800FA374_12F9B4(s16, s16);
void func_800F8FCC_12E60C(void);
void func_800F9988_12EFC8(void);
void func_800FAA38_130078(void);
void func_800FACD8_130318(omObjData*, s32);

extern s32 D_800FCA18;
extern u16 D_800FC3D0_DAFD0;
extern u16 D_800F5144;
extern s16 D_800FC960;
extern unk_FaceLift_01 D_800FC4B0[];
extern unk_FaceLift_00 D_800FC500;
extern Vec3f D_800FC980[];
extern Vec2f D_800FC9F0;
extern s16 D_800FCA1E;
extern s16 D_800FCA28;
extern s16 D_800FCA2A;
