#include "common.h"

typedef struct unk_ovl3C_struct {
/* 0x00 */ f32 unk_00;
/* 0x04 */ f32 unk_04;
/* 0x08 */ f32 unk_08;
/* 0x0C */ f32 unk_0C;
/* 0x10 */ f32 unk_10;
/* 0x14 */ f32 unk_14;
} unk_ovl3C_struct;

typedef struct unkKeyPaWayStruct {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ char unk_02[2];
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
} unkKeyPaWayStruct; //sizeof 0x10

extern unk_ovl3C_struct D_800EE738;

extern u8 D_800F64F8;
extern s16 D_800EE984;
extern s32 D_800FF3B0_KeyPaWay;
extern s16 D_800FF526_KeyPaWay;
extern s16 D_800FF534_KeyPaWay;
extern s16 D_800FF536_KeyPaWay;
extern u16 D_800FF538_KeyPaWay;
extern omObjData* D_800FF53C_KeyPaWay;
extern omObjData** D_800FF548_KeyPaWay;
extern omObjData* D_800FF550_KeyPaWay;
extern omObjData* D_800FF554_KeyPaWay;
extern omObjData* D_800FF558_KeyPaWay;
extern omObjData* D_800FF55C_KeyPaWay;
extern omObjData* D_800FF560_KeyPaWay;
extern Vec3f D_800FF564_KeyPaWay;
extern omObjData* D_800FF574_KeyPaWay;
extern Vec3f D_800FF584_KeyPaWay;
extern omObjData* D_800FF590_KeyPaWay;
extern omObjData** D_800FF594_KeyPaWay;
extern Vec3f D_800FF598_KeyPaWay;
extern s16 D_800FF5A4_KeyPaWay;
extern s16 D_800FF514_KeyPaWay;
extern s16 D_800FF516_KeyPaWay[];
extern s16 D_800FF532_KeyPaWay;
extern s32 D_800FF540_KeyPaWay;
extern s32 D_800FF544_KeyPaWay;
extern s32 D_800FF54C_KeyPaWay;
extern s16 D_800FF580_KeyPaWay;
extern s16 D_800FF530_KeyPaWay;
extern omObjData* D_800FF55C_KeyPaWay;
extern u16 D_800FF3A4_KeyPaWay;
extern s16 D_800F3778;

void func_800FA7F4_KeyPaWay(void);
void func_800FE320_KeyPaWay(s32);
u16 func_800FDE64_KeyPaWay(f32 arg0, f32 arg1, f32 arg2, omObjData* arg3[]);
void func_800F6E6C_KeyPaWay(omObjData*);
void func_800F6C58_KeyPaWay(void);
void func_800F6BD8_KeyPaWay(omObjData*);
void func_800F6D98_KeyPaWay(omObjData*);
void func_800F747C_KeyPaWay(void);
void func_800F76C8_KeyPaWay(void);
void func_800F842C_KeyPaWay(void);
void func_800F8918_KeyPaWay(void);
void func_800F8C54_KeyPaWay(void);
void func_800F8C70_KeyPaWay(void);
void func_800F8C8C_KeyPaWay(void);
void func_800F8CA8_KeyPaWay(void);
void func_800FA3B0_KeyPaWay(void);
void func_800FA3D0_KeyPaWay(void);
void func_800FA3F0_KeyPaWay(void);
void func_800FA410_KeyPaWay(void);
void func_800FA430_KeyPaWay(void);
void func_800FA7E0_KeyPaWay(omObjData*);
void func_800FB9D4_KeyPaWay(void);
void func_800FCC6C_KeyPaWay(void);
void func_800FE2E8_KeyPaWay(void);
void func_800FE33C_KeyPaWay(void);
void func_800FE710_KeyPaWay(void);
