#include "common.h"
#include "PR/os.h"
#include "engine/mallocblock.h"

typedef struct unk2C0C0Struct10 {
    /* 0x00 */ Hilite unk_00;
    /* 0x10 */ char unk_10[0x30];
    /* 0x40 */ LookAt unk_40;
} unk2C0C0Struct10; //sizeof 0x60

typedef struct unk2C0C0StructD0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02[4];
    /* 0x0A */ s8 unk_0A;
    /* 0x0B */ char unk_0B;
    /* 0x0C */ unk2C0C0Struct90* unk_0C;
    /* 0x10 */ unk2C0C0Struct80* unk_10;
} unk2C0C0StructD0; //sizeof 0x14

typedef struct unk2C0C0StructF0 {
    /* 0x00 */ char unk_00[0x40];
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ void* unk_44;
    /* 0x48 */ unk2C0C0StructC0* unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s16 unk_54;
    /* 0x56 */ char unk_56;
    /* 0x57 */ u8 unk_57;
    /* 0x58 */ u8 unk_58;
    /* 0x59 */ char unk_59[3];
} unk2C0C0StructF0; //sizeof 0x5C
void func_800230D0_23CD0(s32);
void func_8001AAC4_1B6C4(Gfx*, u16, s32, OSMesgQueue*, s32);
s16 func_8001CD00_1D900(char*);
void func_8001D40C_1E00C(void);
void func_8001D7DC_1E3DC(s16, Gfx**);
void func_80023040_23C40(void);
void func_800230D0(s32);
void func_800230D8_23CD8(s16);
void func_80023370_23F70();
void func_800239EC_245EC(void);
void func_8002B890_2C490(unk2C0C0StructC0*);
void func_8002BCD4_2C8D4(unk2C0C0StructC0*);
void func_8002BDC0_2C9C0(unk2C0C0StructC0*);
void func_8002BEC4_2CAC4(unk2C0C0StructC0*);
void func_8002C37C_2CF7C(Matrix4f, Matrix4f);
void func_8002C400_2D000(unk2C0C0StructC0*, s16);
void func_8002C858_2D458(unk2C0C0StructC0*, s32);
void func_8002D2CC_2DECC(unk2C0C0StructC0*, s32, void*, Matrix4f);
void func_8002DC84_2E884(unk2C0C0StructC0*, s16);
void func_8002E488_2F088(unk2C0C0StructC0*, u32*);
void func_80030D50_31950(unk2C0C0StructC0*, s16);
