#include "common.h"
#include "engine/graphics.h"
#include "mallocblock.h"
#include "PR/gbi.h"
#include "PR/mbi.h"

typedef struct Color_RGB8 {
    /* 0x00 */ u8 r;
    /* 0x01 */ u8 g;
    /* 0x02 */ u8 b;
} Color_RGB8; //sizeof 3

typedef struct unk2C0C0Struct10 {
    /* 0x00 */ Hilite unk_00;
    /* 0x10 */ char unk_10[0x30];
    /* 0x40 */ LookAt unk_40;
} unk2C0C0Struct10; //sizeof 0x60

typedef struct unk2C0C0Struct20 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ char unk_01[3];
    /* 0x04 */ s16 unk_04[2]; // unknown array size
    /* 0x08 */ char unk_08[4];
    /* 0x0C */ f32 unk_0C[1]; // unknown array size
    /* 0x10 */ char unk_10[0xC];
    /* 0x1C */ f32 unk_1C[1]; // unknown array size
    /* 0x20 */ char unk_20[0xC];
    /* 0x2C */ u8 unk_2C[4]; // unknown array size
    /* 0x30 */ s16 unk_30;
    /* 0x32 */ s16 unk_32;
} unk2C0C0Struct20; //sizeof 0x34

typedef struct unk2C0C0Struct30 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ char unk_06[2];
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ u16 unk_0A;
    /* 0x0C */ u16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ u16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ u32 unk_14;
    /* 0x18 */ char unk_18[0x18];
    /* 0x30 */ u8 unk_30;
    /* 0x31 */ char unk_31[3];
    /* 0x34 */ unk2C0C0Struct20* unk_34;
    /* 0x38 */ char unk_38[0x12];
    /* 0x4A */ s16 unk_4A;
    /* 0x4C */ s16 unk_4C;
    /* 0x4E */ s16 unk_4E;
    /* 0x50 */ s16 unk_50;
    /* 0x52 */ s16 unk_52;
    /* 0x54 */ s16 unk_54;
    /* 0x56 */ char unk_56[2];
    /* 0x58 */ struct unk2C0C0StructC0* unk_58;
} unk2C0C0Struct30; //sizeof 0x5C

typedef struct unk2C0C0Struct40 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x02 */ char unk_06[2];
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ char unk_44[4];
    /* 0x48 */ struct unk2C0C0StructC0* unk_48;
    /* 0x4C */ Matrix4f unk_4C;
} unk2C0C0Struct40; //sizeof 0x8C

typedef struct unk2C0C0Struct50 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ char unk_02[2];
    /* 0x04 */ s16* unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ char unk_2C[0xC];
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ f32 unk_44;
    /* 0x48 */ f32 unk_48;
    /* 0x4C */ f32 unk_4C;
    /* 0x50 */ f32 unk_50;
    /* 0x54 */ f32 unk_54;
    /* 0x58 */ f32 unk_58;
    /* 0x5C */ char unk_5C[4];
    /* 0x60 */ struct unk2C0C0StructC0* unk_60;
    /* 0x64 */ Matrix4f unk_64;
} unk2C0C0Struct50; //sizeof 0xA4

typedef struct unk2C0C0Struct60 {
    /* 0x00 */ char unk_00[0x1A];
    /* 0x1A */ s16 unk_1A;
    /* 0x1C */ char unk_1C[8];
    /* 0x2C */ s32 unk_24;
} unk2C0C0Struct60; //sizeof unknown

typedef struct unk2C0C0Struct70 {
    /* 0x00 */ char unk_00[0x18];
    /* 0x1A */ u8 unk_18;
    /* 0x1B */ u8 unk_19;
    /* 0x1A */ u8 unk_1A;
    /* 0x1B */ u8 unk_1B;
    /* 0x1C */ char unk_1C[8];
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ char unk_28[4];
    /* 0x2C */ unk2C0C0Struct60* unk_2C;
} unk2C0C0Struct70; //sizeof unknown

typedef struct unk2C0C0Struct80 {
    /* 0x00 */ s8 unk_00;
    /* 0x01 */ s8 unk_01;
    /* 0x02 */ s8 unk_02;
    /* 0x03 */ s8 unk_03;
    /* 0x04 */ s8 unk_04;
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ u8 unk_06;
    /* 0x07 */ u8 unk_07;
    /* 0x08 */ char unk_08;
    /* 0x09 */ u8 unk_09;
    /* 0x0A */ char unk_0A[2];
    /* 0x0C */ unk2C0C0Struct70* unk_0C;
} unk2C0C0Struct80 ; //sizeof 0x10

typedef struct unk2C0C0Struct90 {
    /* 0x00 */ char unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ char unk_04;
    /* 0x05 */ Color_RGB8 unk_05;
    /* 0x08 */ char unk_08;
    /* 0x09 */ s8 unk_09;
    /* 0x0A */ s8 unk_0A;
    /* 0x0B */ s8 unk_0B;
    /* 0x0C */ s8 unk_0C;
    /* 0x0D */ char unk_0D;
} unk2C0C0Struct90; //sizeof 0xE

typedef struct unk2C0C0StructA0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
} unk2C0C0StructA0; //sizeof 6

typedef struct unk2C0C0StructB0 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ char unk_01;
    /* 0x02 */ s16 unk_02[1]; // unknown array size
    /* 0x04 */ char unk_04[8];
    /* 0x08 */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
} unk2C0C0StructB0; //sizeof 0x18

typedef struct unk2C0C0StructC0 {
    /* 0x00 */ Gfx** unk_00;
    /* 0x04 */ struct unk2C0C0StructE0* unk_04;
    /* 0x08 */ struct unk2C0C0StructE0* unk_08[8];
    /* 0x28 */ u8 unk_28;
    /* 0x29 */ char unk_29;
    /* 0x2A */ s8 unk_2A;
    /* 0x2B */ s8 unk_2B;
    /* 0x2C */ s8 unk_2C;
    /* 0x2D */ s8 unk_2D;
    /* 0x2E */ s8 unk_2E;
    /* 0x2F */ s8 unk_2F;
    /* 0x30 */ s8 unk_30;
    /* 0x31 */ s8 unk_31;
    /* 0x32 */ char unk_32[0x32];
    /* 0x64 */ u8 unk_64;
    /* 0x65 */ char unk_65[3];
    /* 0x68 */ u16 unk_68;
    /* 0x6A */ s16 unk_6A;
    /* 0x6C */ s16 unk_6C;
    /* 0x6E */ s16 unk_6E;
    /* 0x70 */ s16 unk_70;
    /* 0x72 */ u16 unk_72;
    /* 0x74 */ s16 unk_74;
    /* 0x76 */ char unk_76[2];
    /* 0x78 */ unk2C0C0StructA0* unk_78;
    /* 0x7C */ Color_RGB8* unk_7C;
    /* 0x80 */ unk2C0C0Struct30* unk_80;
    /* 0x84 */ s16 unk_84;
    /* 0x86 */ char unk_86[2];
    /* 0x88 */ unk2C0C0Struct40* unk_88;
    /* 0x8C */ char unk_8C[0x14];
    /* 0xA0 */ unk2C0C0Struct50* unk_A0;
    /* 0xA4 */ unk2C0C0Struct80* unk_A4;
    /* 0xA8 */ unk2C0C0Struct90* unk_A8;
    /* 0xAC */ s32 unk_AC;
    /* 0xB0 */ s32 unk_B0;
    /* 0xB4 */ s32 unk_B4;
    /* 0xB8 */ s32 unk_B8;
    /* 0xBC */ unk2C0C0Struct70* unk_BC;
    /* 0xC0 */ s32 unk_C0;
    /* 0xC4 */ s32 unk_C4;
    /* 0xC8 */ s32 unk_C8;
    /* 0xCC */ s32 unk_CC;
    /* 0xD0 */ unk2C0C0StructB0* unk_D0;
} unk2C0C0StructC0; //sizeof unknown

typedef struct unk2C0C0StructD0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02[4];
    /* 0x0A */ s8 unk_0A;
    /* 0x0B */ char unk_0B;
    /* 0x0C */ unk2C0C0Struct90* unk_0C;
    /* 0x10 */ unk2C0C0Struct80* unk_10;
} unk2C0C0StructD0; //sizeof 0x14

typedef struct unk2C0C0StructE0 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s16 unk_04;
    /* 0x06 */ char unk_06[2];
    /* 0x08 */ s16 unk_08;
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ Color_RGB8 unk_0C;
    /* 0x0F */ u8 unk_0F;
} unk2C0C0StructE0; //sizeof 0x10

typedef struct unk2C0C0StructF0 {
    /* 0x00 */ char unk_00[0x40];
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ void* unk_44;
    /* 0x48 */ unk2C0C0StructC0* unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s16 unk_54;
    /* 0x56 */ char unk_56;
    /* 0x57 */ u8 unk_57;
    /* 0x58 */ u8 unk_58;
    /* 0x59 */ char unk_59[3];
} unk2C0C0StructF0; //sizeof 0x5C

void func_8001AAC4(Gfx*, u16, s32, OSMesgQueue*, s32);
s16 func_8001CD00(u8*);
void func_8001D40C();
void func_8001D7DC(s16, Gfx**);
void func_80023040();
void func_800230D0(s32);
void func_800230D8(s16);
void func_80023370();
void func_800239EC();
void func_8002B890(unk2C0C0StructC0*);
void func_8002BCD4(unk2C0C0StructC0*);
void func_8002BDC0(unk2C0C0StructC0*);
void func_8002BEC4(unk2C0C0StructC0*);
void func_8002C37C(Matrix4f, Matrix4f);
void func_8002C400(unk2C0C0StructC0*, s16);
void func_8002C858(unk2C0C0StructC0*, s32);
void func_8002D2CC(unk2C0C0StructC0*, s32, void*, Matrix4f);
void func_8002DC84(unk2C0C0StructC0*, s16);
void func_8002E488(unk2C0C0StructC0*, u32*);
void func_80030D50(unk2C0C0StructC0*, s16);
void func_80031054(unk2C0C0Struct90*, unk2C0C0Struct80*, s32);
void func_800318D0(u16);
void func_80031BB4();
void func_80031C60(unk2C0C0StructC0*, s32, s16);
void func_80031D78(unk2C0C0StructC0*, s16);
