#include "common.h"

void HuPrcVSleep(void);
extern s16 D_800D84E4;
extern s8 D_800F37BB; //minigame island lives
extern s8 D_800F37C4; //minigame island coins
extern s32 D_800C54D0;
extern s32 D_800C54D4;
void func_80055D28(void);
extern s32 D_800C56B0[];
extern char D_800CB2A4[];
extern s16 D_800D84E0;
extern s16 D_800D84E2;
extern s16 D_800D84E4;
extern s16 D_800D84E6;
extern s16 D_800D84E8;
extern s16 D_800D84EA;
extern unkCommonStruct0 D_800D84F0[];
extern s16 D_800D8504;
extern Process* D_800D8558;
extern s8 D_800F37B8;
void func_80055E08(void);
void func_80067284(s16, s32, f32);
extern s16 D_800D855C;
extern s16 D_800D855E;
extern s16 D_800D8560;
extern s16 D_800D8562;
extern unkCommonStruct0 D_800D8568[];
extern s16 D_800D857C;
extern Process* D_800D85D0;
void func_80055EE8(void);
void func_8005608C(void);
void func_80056380(void);
extern s16 D_800D85D4;
extern s16 D_800D85D6;
extern unkCommonStruct0 D_800D85D8[];
extern unkCommonStruct0 D_800D8640[];
extern Process* D_800D86A8;
extern s16 D_800D855C;
extern s16 D_800D855E;
extern s16 D_800D8560;
extern s16 D_800D8562;
extern unkCommonStruct0 D_800D8568[];
extern Process* D_800D85D0;
void func_800565E0(void);
void func_80056630(void);
void func_800566A4(void);
typedef struct unkStruct3 {
s16 unk_00;
char unk_02[0x52];
unkCommonStruct0 unk_54;
} unkStruct3;

void func_80055B9C(void);
extern s8 D_800CB298;
extern s8 D_800CB2A0;
extern s16 D_800D85D4;
extern s16 D_800D85D6;
extern unkStruct3 D_800D85EC;
extern Process* D_800D86A8;
s32 HuPrcKill(Process* process);
void func_8005456C(s32);
void func_80055228(void);
extern s32 D_800C54D0;
extern s32 D_800C54D4;
void func_80053A1C(void);
void func_800543D8(s32);
void func_80054758(s32, s32, s16);
extern s16 D_800C54D8[][2];
extern Process* D_800D83A0;
extern s16 D_800D84A8;
extern s16 D_800D84AA;
//D_800D83A8
typedef struct unkStruct4 {
    /* 0x00 */ char pad0[4];
    /* 0x04 */ u8 unk_04;
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ s16 unk_06;                            /* inferred */
    /* 0x08 */ char pad8[2];                     /* maybe part of unk6[0x13]? */
    /* 0x0A */ s16 unk_0A;
    /* 0x0C */ char unk_0C[0x20];
    /* 0x2C */ void* unk2C;                         /* inferred */
    /* 0x30 */ char pad30[0x10];                    /* maybe part of unk2C[5]? */
} unkStruct4;  

extern unkStruct4 D_800D83A8[4];
extern s32 D_800D84D0[];
extern s16 D_800D85D4;
extern s16 D_800D8654;
extern s16 D_800F329A;
extern s16 D_800F3750;
extern f32 D_800C5654[];
void func_8005528C(omObjData* arg0);
