#include "common.h"
#include "mallocblock.h"
#include "PR/gbi.h"
#include "PR/mbi.h"
#include "process.h"
#include "stdarg.h"

typedef struct unk72D90Struct0 {
    /* 0x00 */ Vtx* unk_00;
    /* 0x04 */ Gfx* unk_04;
} unk72D90Struct0; //sizeof 8

typedef struct unk72D90Struct1 {
    /* 0x00 */ s16 unk_00;
    /* 0x02 */ s16 unk_02;
    /* 0x04 */ s32 unk_04;
} unk72D90Struct1; //sizeof unknown

typedef struct unk72D90Struct2 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ char unk_01;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u16 unk_04;
} unk72D90Struct2; //sizeof 6

typedef struct unk72D90Struct3 {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ char unk_01[0x2F];
} unk72D90Struct3; //sizeof 0x30

extern void guLookAt(Mtx*, f32, f32, f32, f32, f32, f32, f32, f32, f32);
extern void guPerspective(Mtx*, u16*, f32, f32, f32, f32, f32);
void* HuMemAlloc(s32);
u32 osVirtualToPhysical(void*);
u32 strlen(const char*);
void* func_80014614(s32);
void func_80014750(void*);
unkGlobalStruct_00* func_80023684(s32, s32);
void func_800238F0(s32);
s32 func_8002451C(s32, void (*)(Gfx**), s32);
void func_8003A060(Gfx**, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32, s32);
s16 func_8006DB3C(s16, s32, s16, s16, s16);
s16 func_8006DD8C(s16, s16);
void func_80071598(s16);
void func_8007166C(s16);
s32 func_80072740(Gfx**);
s32 func_8007281C(Gfx**);
void func_800728F4(Gfx**, u8, s32*);
s32 func_800729C8(Gfx**);
s32 func_80072B5C(Gfx**);
void func_80072C34(Gfx**, s32);
void func_80072E1C(Gfx**);
void func_80072E5C(Gfx**, s32);
s32 func_80073008(Gfx**);
s32 func_800730E4(Gfx**);
Gfx* func_80073100(Gfx*, Vtx*);
