#include "common.h"

typedef struct yetAnotherUnkStruct {
/* 0x00 */ s32 unk_00;
/* 0x04 */ s16 unk_04;
/* 0x06 */ s16 unk_06;
/* 0x08 */ s32 unk_08;
/* 0x0C */ Vec4f unk_0C;
/* 0x1C */ s32 unk_1C;
/* 0x20 */ s32 unk_20;
/* 0x24 */ s32 unk_24;
/* 0x28 */ void* (*unk_28)();
} yetAnotherUnkStruct;

extern yetAnotherUnkStruct D_800F8A50[];

extern s32 D_800F8A30[];
void func_800F67B0_2D4A00(void);
void func_800F688C_2D4ADC(void);
void func_800F6C58_2D4EA8(void);
void func_800F73C8_2D5618(void);
void func_800F6B68_2D4DB8(Object*);
void func_800F6778_2D49C8(s32);
extern Object* D_800F8DE8;
void func_800F6C00_2D4E50(Object*);
extern s16 D_800F384C;
extern char D_800F8D10[];
extern char D_800F8D18[];
extern s16 D_800F8D70;
extern Process* D_800F8D74;
extern char D_800F8D78[];
extern s16 D_800F8D8C[];
extern s16 D_800F8DE0;
extern s16 D_800F8DE2;
extern u16 D_800F8DE4;
extern Vec3f* D_800ED610;
extern Vec3f* D_800ED72C;
extern Vec3f D_800F89A0[];
extern Vec3f D_800F89C4[];
extern s32 D_800ED140;
extern s16 D_800F3B74;
void func_800F6BC4_2D4E14(void);

